Repository: ClassicPress/ClassicPress-Migration-Plugin
Catalog: languages/switch-to-classicpress-*.po
Languages: ru_ru

source: Switch to ClassicPress
ru_ru: Перейти на ClassicPress

source: Switch your WordPress installation to ClassicPress.
ru_ru: Перейдите со своей инсталляции WordPress на ClassicPress.

source: Feedback and Support
ru_ru: Обратная связь и поддержка

source: Do you have feedback about this plugin, or about ClassicPress itself? Need help with something? We'd love to know what you think!
ru_ru: У вас есть замечания об этом плагине или о ClassicPress в целом? Нужна какая-либо помощь? Мы будем счастливы узнать, что вы думаете!

source: For support, suggestions for improvement, or general discussion about how the plugin works, visit us in our <a href="%1$s">support forum</a> or <a href="%2$s">Slack group</a>.
ru_ru: Чтобы получить поддержку, предложить улучшения или обсудить работу плагина в целом, загляните к нам на <a href="%1$s">форум поддержки</a> или в <a href="%2$s">группу Slack</a>.

source: For <strong>specific</strong> bug reports or suggestions, <a href="%s">add a new issue on GitHub</a>.
ru_ru: Для <strong>конкретных</strong> сообщений об ошибках и предложений, <a href="%s">создайте новую тему на GitHub</a>.

source: Hey, good job, you're already running ClassicPress!
ru_ru: Отличная работа, вы уже используете ClassicPress!

source: You can <a href="%s">delete this plugin</a> now.
ru_ru: Теперь вы можете <a href="%s">удалить этот плагин</a>.

source: Sorry, this plugin doesn't support sites hosted on WordPress.com.
ru_ru: Извините, этот плагин не поддерживает сайты, размещённые на WordPress.com.

source: In order to switch to ClassicPress, you'll need to <a href="https://move.wordpress.com/">move to a self-hosted WordPress site</a> first.
ru_ru: Для перехода на ClassicPress вам понадобится сначала <a href="https://move.wordpress.com/">переместить сайт на отдельный хостинг</a>.

source: Sorry, you're not allowed to perform this action.
ru_ru: Извините, вам не разрешено выполнять это действие.

source: Please contact a site administrator for more information.
ru_ru: Пожалуйста, обратитесь к администратору сайта за более подробной информацией.

source: This plugin supports WordPress versions <strong>%1$s</strong> to <strong>%2$s</strong> (and some newer development versions).
ru_ru: Этот плагин поддерживает версии WordPress с <strong>%1$s</strong> по <strong>%2$s</strong> (и некоторые более новые девелоперские версии).

source: The preflight check for supported WordPress versions has been <strong class="cp-emphasis">disabled</strong>.
ru_ru: Предварительная проверка поддерживаемых версий WordPress была <strong class="cp-emphasis">отключена</strong>.

source: We cannot guarantee that the migration process is going to work, and it may even leave your current installation partially broken.
ru_ru: Мы не можем гарантировать, что процесс миграции сработает, он даже может оставить вашу текущую установку частично повреждённой.

source: <strong class="cp-emphasis">Proceed at your own risk!</strong>
ru_ru: <strong class="cp-emphasis">Продолжайте на свой страх и риск!</strong>

source: You are running WordPress version <strong>%s</strong>.
ru_ru: Вы используете WordPress в версии <strong>%s</strong>.

source: Migration is supported, but content edited in the new WordPress block editor may not be fully compatible with ClassicPress.
ru_ru: Миграция поддерживается, но контент, который редактировался в новом блочном редакторе WordPress, может не оказаться полностью совместимым с ClassicPress.

source: After the migration, we recommend reviewing each recently edited post or page and restoring to an earlier revision if needed.
ru_ru: После миграции мы рекомендуем просмотреть все недавно созданные посты или страницы и при необходимости восстановить более ранние ревизии.

source: ClassicPress supports PHP versions <strong>%1$s</strong> and <strong>newer</strong>.
ru_ru: ClassicPress поддерживает PHP версии <strong>%1$s</strong> и <strong>новее</strong>.

source: You are using PHP version <strong>%s</strong>.
ru_ru: Вы используете PHP версии <strong>%s</strong>.

source: ClassicPress only supports communicating with the ClassicPress.net API over SSL.
ru_ru: ClassicPress поддерживает взаимодействие с ClassicPress.net API только через SSL.

source: This site supports making outgoing connections securely using SSL.
ru_ru: Этот сайт поддерживает безопасные исходящие соединения посредством SSL.

source: This site <strong class="cp-emphasis">does not</strong> support making outgoing connections securely using SSL.
ru_ru: Этот сайт <strong class="cp-emphasis">не</strong> поддерживает безопасные исходящие соединения посредством SSL.

source: An existing <code>composer.json</code> file was detected on your site. This file will be <strong class="cp-emphasis">overwritten</strong> during migration.
ru_ru: На вашем сайте обнаружен существующий файл <code>composer.json</code>. Он будет <strong class="cp-emphasis">перезаписан</strong> во время миграции.

source: If you have previously installed ClassicPress on this site, then you can ignore this warning.
ru_ru: Если ранее вы уже установили ClassicPress на этом сайте, то можете проигнорировать это предупреждение.

source: If you are using <code>composer.json</code> to manage dependencies for this site, then you should <strong class="cp-emphasis">back up this file</strong> before continuing, and restore it after the migration.
ru_ru: Если вы используете <code>composer.json</code> для управления зависимостями этого сайта, то перед тем как продолжить, вам нужно <strong class="cp-emphasis">сделать резервную копию этого файла</strong>, а затем восстановить его после миграции.

source: Your WordPress core files will be overwritten.
ru_ru: Файлы ядра WordPress будут перезаписаны.

source: <strong class="cp-emphasis">Unable to determine whether core files were modified</strong>.
ru_ru: <strong class="cp-emphasis">Невозможно определить, были ли изменены файлы ядра.</strong>.

source: This is most likely because you are running a development version of WordPress.
ru_ru: Скорее всего, это из-за того, что вы используете девелоперскую версию WordPress.

source: You have not modified any core files.
ru_ru: Вы не модифицировали никакие файлы ядра.

source: Modified core files detected. These customisations will be lost.
ru_ru: Обнаружены изменённые файлы ядра. Эти нестандартные модификации будут потеряны.

source: If you have JavaScript enabled, you can see a list of modified files <strong>in your browser console</strong>.
ru_ru: Если у вас включен JavaScript, вы можете увидеть список изменённых файлов <strong>в консоли вашего браузера</strong>.

source: Multisite installation detected.
ru_ru: Обнаружена мультисайтовая установка.

source: Migrating to ClassicPress is supported, but it is <strong class="cp-emphasis">very important</strong> that you perform a backup first.
ru_ru: Переход на ClassicPress поддерживается, но <strong class="cp-emphasis">очень важно</strong>, чтобы вы сначала сделали резервную копию.

source: It would also be a good idea to try the migration on a development or staging site first.
ru_ru: Хорошей идеей также будет сначала опробовать миграцию на стендовом сайте.

source: It looks like you're ready to switch to ClassicPress!
ru_ru: Похоже, вы готовы к переходу на ClassicPress!

source: First things first, just in case something does not go as planned, <strong class="cp-emphasis">please make a backup of your site files and database</strong>.
ru_ru: Прежде всего, просто на случай если что-то пойдёт не по плану, <strong class="cp-emphasis">сделайте резервную копию файлов и базы данных вашего сайта, пожалуйста</strong>.

source: After clicking the button below, the migration process will start.
ru_ru: После нажатия на кнопку ниже начнётся процесс миграции.

source: Switch this <strong>entire multisite installation</strong> to ClassicPress <strong>now</strong>!
ru_ru: Переключить <strong>установку всего этого мультисайта</strong> на ClassicPress <strong>сейчас</strong>!

source: Switch this site to ClassicPress <strong>now</strong>!
ru_ru: Переключить этот сайт на ClassicPress <strong>сейчас</strong>!

source: More Details
ru_ru: Больше подробностей

source: All core WordPress files will be replaced with their ClassicPress versions. Depending on the server this website is hosted on, this process can take a while.
ru_ru: Все файлы ядра WordPress будут заменены их ClassicPress версиями. Этот процесс может занять некоторое время, в зависимости от сервера, на котором размещается этот сайт.

source: We want to emphasise that <strong>all your own content (posts, pages, themes, plugins, uploads, wp-config.php file, .htaccess file, etc.) is 100% safe</strong> as the migration process is not touching any of that.
ru_ru: Мы хотим подчеркнуть, что <strong>весь ваш контент (записи, страницы, темы, плагины, загрузки, файл wp-config.php, файл .htaccess file и т.п.) на 100 % в безопасности</strong>, поскольку процесс миграции не затрагивает ничего из перечисленного.

source: Once the process has completed, you will see the about page of ClassicPress where you can read more information about the project.
ru_ru: Когда процесс завершится, вы увидите страницу о ClassicPress, из которой сможете почерпнуть больше информации о проекте.

source: We thank you for switching from WordPress to ClassicPress!<br>The business-focused CMS. Powerful. Versatile. Predictable.
ru_ru: Мы благодарим вас за переход с WordPress на ClassicPress!<br> Бизнес-ориентированную CMS. Мощную. Универсальную. Предсказуемую.

source: Sorry, we can't switch this site to ClassicPress at this time.
ru_ru: Извините, в данный момент мы не можем переключить этот сайт на ClassicPress.

source: If you're not sure how to fix the issues above, contact your hosting provider for help.
ru_ru: Если вы не уверены в том, как исправить вышеуказанные ошибки, обратитесь за помощью к своему поставщику хостинга.

source: Show advanced controls
ru_ru: Показать расширенные настройки

source: Switch to any version of ClassicPress or WordPress
ru_ru: Переход на любую версию ClassicPress или WordPress

source: Warning 1:
ru_ru: Предупреждение 1:

source: Use this form to switch to other versions of WordPress, or ClassicPress <strong class="cp-emphasis">migration builds</strong>!
ru_ru: Используйте эту форму, чтобы переключиться на другие версии WordPress или <strong class="cp-emphasis">миграционные сборки</strong> ClassicPress!

source: Official release builds of ClassicPress <strong class="cp-emphasis">will not work</strong>.
ru_ru: Сборки официальных релизов ClassicPress <strong class="cp-emphasis">не будут работать</strong>.

source: You can find ClassicPress migration builds <a href="%s">on GitHub</a>.
ru_ru: Вы можете найти миграционные сборки ClassicPress <a href="%s">на GitHub</a>.

source: Warning 2:
ru_ru: Предупреждение 2:

source: Warning:
ru_ru: Предупреждение:

source: As long as the regular requirements for your target version are met, like the preflight checks for ClassicPress, then we haven't been able to break this yet. However, that doesn't mean it works under all circumstances!
ru_ru: Поскольку все общие требования для вашей целевой версии выполнены, как в случае предварительных проверок для ClassicPress, мы не в состоянии помешать этому. Тем не менее, это вовсе не означает, что всё будет работать при любых обстоятельствах!

source: Please, definitely <strong class="cp-emphasis">take a backup of your site</strong> before using this feature.
ru_ru: Пожалуйста, обязательно <strong class="cp-emphasis">сделайте резервную копию своего сайта</strong> перед использованием этого инструмента.

source: Build URL:
ru_ru: URL сборки:

source: Do the custom migration now!
ru_ru: Выполнить произвольную миграцию!

source: Migrating WordPress to ClassicPress
ru_ru: Переход с WordPress на ClassicPress

source: WordPress successfully migrated to ClassicPress!
ru_ru: WordPress успешно переведена на ClassicPress!

source: Welcome to ClassicPress! You will be redirected to the About ClassicPress screen. If not, click <a href="%2$s">here</a>.
ru_ru: Добро пожаловать в ClassicPress! Вы будете перенаправлены на экран «О ClassicPress». Если нет, нажмите <a href="%2$s">сюда</a>.

source: Welcome to ClassicPress! <a href="%2$s">Learn more</a>.
ru_ru: Добро пожаловать в ClassicPress! <a href="%2$s">Узнать больше</a>.

source: The "Switch to ClassicPress" plugin must be <strong>network activated</strong> on multisite installations.
ru_ru: Плагин "Переход на ClassicPress" должен быть <strong>активирован для всей сети</strong> при мультисайтовых установках.

source: If you need help with this, please contact your site administrator.
ru_ru: Если вам нужна помощь с этим, пожалуйста, свяжитесь со своим системным администратором.

source: Switch
ru_ru: Перейти

source: Could not communicate with the ClassicPress API server
ru_ru: Не удалось соединиться с сервером API ClassicPress
